In [14]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt 
import seaborn as snb

In [15]:
df = pd.read_csv('alldata.csv')
df.head()

,position,company,description,reviews,location
0,Development Director,ALS TDI,Development Director\nALS Therapy Development ...,NaN,"Atlanta, GA 30301"
1,An Ostentatiously-Excitable Principal Research...,The Hexagon Lavish,"Job Description\n\n""The road that leads to acc...",NaN,"Atlanta, GA"
2,Data Scientist,Xpert Staffing,"Growing company located in the Atlanta, GA are...",NaN,"Atlanta, GA"
3,Data Analyst,Operation HOPE,DEPARTMENT: Program OperationsPOSITION LOCATIO...,44.0,"Atlanta, GA 30303"
4,Assistant Professor -TT - Signal Processing & ...,Emory University,DESCRIPTION\nThe Emory University Department o...,550.0,"Atlanta, GA"

In [16]:
df.dtypes

position        object
company         object
description     object
reviews        float64
location        object
dtype: object

In [17]:
df.keys()

Index(['position', 'company', 'description', 'reviews', 'location'], dtype='object')

In [18]:
df.isnull()

      position  company  description  reviews  location
0        False    False        False     True     False
1        False    False        False     True     False
2        False    False        False     True     False
3        False    False        False    False     False
4        False    False        False    False     False
...        ...      ...          ...      ...       ...
6959     False    False        False    False     False
6960     False    False        False    False     False
6961     False    False        False    False     False
6962     False    False        False    False     False
6963     False    False        False    False     False

[6964 rows x 5 columns]

In [19]:
df.isnull().sum()

position         11
company          11
description      11
reviews        1638
location         11
dtype: int64

In [20]:
df = df.replace(['-','na'], np.nan)
df

,position,company,description,reviews,location
0,Development Director,ALS TDI,Development Director\nALS Therapy Development ...,NaN,"Atlanta, GA 30301"
1,An Ostentatiously-Excitable Principal Research...,The Hexagon Lavish,"Job Description\n\n""The road that leads to acc...",NaN,"Atlanta, GA"
2,Data Scientist,Xpert Staffing,"Growing company located in the Atlanta, GA are...",NaN,"Atlanta, GA"
3,Data Analyst,Operation HOPE,DEPARTMENT: Program OperationsPOSITION LOCATIO...,44.0,"Atlanta, GA 30303"
4,Assistant Professor -TT - Signal Processing & ...,Emory University,DESCRIPTION\nThe Emory University Department o...,550.0,"Atlanta, GA"
...,...,...,...,...,...
6959,Data Developer / Machine Learning Analyst,NetApp,Are you data-driven? We at NetApp believe in t...,574.0,"Sunnyvale, CA"
6960,Scientist I,"Pharmacyclics, an Abbvie Company",Pharmacyclics is committed to the development ...,26.0,"Sunnyvale, CA"
6961,Intern Scientist,Oath Inc,"Oath, a subsidiary of Verizon, is a values-led...",5.0,"Sunnyvale, CA"
6962,Senior Data & Applied Scientist,Microsoft,We are the Bing Core Relevance team responsibl...,4618.0,"Sunnyvale, CA"
6963,"Principal Data Scientist, Deep Learning",Comcast,Comcast’s Technology &amp; Product organizatio...,11610.0,"Sunnyvale, CA 94089"

In [21]:
df.dropna()

,position,company,description,reviews,location
3,Data Analyst,Operation HOPE,DEPARTMENT: Program OperationsPOSITION LOCATIO...,44.0,"Atlanta, GA 30303"
4,Assistant Professor -TT - Signal Processing & ...,Emory University,DESCRIPTION\nThe Emory University Department o...,550.0,"Atlanta, GA"
5,Manager of Data Engineering,McKinsey & Company,Qualifications\nBachelor’s degree in Computer ...,385.0,"Atlanta, GA 30318"
6,"Product Specialist - Periscope, New Ventures",McKinsey & Company,Qualifications\nBachelor’s degree\n5-7 years o...,385.0,"Atlanta, GA 30318"
7,"Junior to Mid-level Engineer, Geologist or Env...",Wood,Overview / Responsibilities\nWood Environment ...,899.0,"Atlanta, GA"
...,...,...,...,...,...
6959,Data Developer / Machine Learning Analyst,NetApp,Are you data-driven? We at NetApp believe in t...,574.0,"Sunnyvale, CA"
6960,Scientist I,"Pharmacyclics, an Abbvie Company",Pharmacyclics is committed to the development ...,26.0,"Sunnyvale, CA"
6961,Intern Scientist,Oath Inc,"Oath, a subsidiary of Verizon, is a values-led...",5.0,"Sunnyvale, CA"
6962,Senior Data & Applied Scientist,Microsoft,We are the Bing Core Relevance team responsibl...,4618.0,"Sunnyvale, CA"
6963,"Principal Data Scientist, Deep Learning",Comcast,Comcast’s Technology &amp; Product organizatio...,11610.0,"Sunnyvale, CA 94089"

In [22]:
df.drop(['description'],axis=1)

,position,company,reviews,location
0,Development Director,ALS TDI,NaN,"Atlanta, GA 30301"
1,An Ostentatiously-Excitable Principal Research...,The Hexagon Lavish,NaN,"Atlanta, GA"
2,Data Scientist,Xpert Staffing,NaN,"Atlanta, GA"
3,Data Analyst,Operation HOPE,44.0,"Atlanta, GA 30303"
4,Assistant Professor -TT - Signal Processing & ...,Emory University,550.0,"Atlanta, GA"
...,...,...,...,...
6959,Data Developer / Machine Learning Analyst,NetApp,574.0,"Sunnyvale, CA"
6960,Scientist I,"Pharmacyclics, an Abbvie Company",26.0,"Sunnyvale, CA"
6961,Intern Scientist,Oath Inc,5.0,"Sunnyvale, CA"
6962,Senior Data & Applied Scientist,Microsoft,4618.0,"Sunnyvale, CA"
6963,"Principal Data Scientist, Deep Learning",Comcast,11610.0,"Sunnyvale, CA 94089"

In [23]:
# Checking for missing values
mean_lat=df['reviews'].mean()
mean_lat

3179.0891851295532

In [24]:
df['position'].str.upper()

0                                    DEVELOPMENT DIRECTOR
1       AN OSTENTATIOUSLY-EXCITABLE PRINCIPAL RESEARCH...
2                                          DATA SCIENTIST
3                                            DATA ANALYST
4       ASSISTANT PROFESSOR -TT - SIGNAL PROCESSING & ...
                              ...
6959            DATA DEVELOPER / MACHINE LEARNING ANALYST
6960                                          SCIENTIST I
6961                                     INTERN SCIENTIST
6962                      SENIOR DATA & APPLIED SCIENTIST
6963              PRINCIPAL DATA SCIENTIST, DEEP LEARNING
Name: position, Length: 6964, dtype: object

In [25]:
df1= df.copy()
df1.insert(1,'V1','No Value',allow_duplicates=True)
df1

,position,V1,company,description,reviews,location
0,Development Director,No Value,ALS TDI,Development Director\nALS Therapy Development ...,NaN,"Atlanta, GA 30301"
1,An Ostentatiously-Excitable Principal Research...,No Value,The Hexagon Lavish,"Job Description\n\n""The road that leads to acc...",NaN,"Atlanta, GA"
2,Data Scientist,No Value,Xpert Staffing,"Growing company located in the Atlanta, GA are...",NaN,"Atlanta, GA"
3,Data Analyst,No Value,Operation HOPE,DEPARTMENT: Program OperationsPOSITION LOCATIO...,44.0,"Atlanta, GA 30303"
4,Assistant Professor -TT - Signal Processing & ...,No Value,Emory University,DESCRIPTION\nThe Emory University Department o...,550.0,"Atlanta, GA"
...,...,...,...,...,...,...
6959,Data Developer / Machine Learning Analyst,No Value,NetApp,Are you data-driven? We at NetApp believe in t...,574.0,"Sunnyvale, CA"
6960,Scientist I,No Value,"Pharmacyclics, an Abbvie Company",Pharmacyclics is committed to the development ...,26.0,"Sunnyvale, CA"
6961,Intern Scientist,No Value,Oath Inc,"Oath, a subsidiary of Verizon, is a values-led...",5.0,"Sunnyvale, CA"
6962,Senior Data & Applied Scientist,No Value,Microsoft,We are the Bing Core Relevance team responsibl...,4618.0,"Sunnyvale, CA"
6963,"Principal Data Scientist, Deep Learning",No Value,Comcast,Comcast’s Technology &amp; Product organizatio...,11610.0,"Sunnyvale, CA 94089"

In [26]:
df1.drop(['V1','description', 'location'],axis=1)

,position,company,reviews
0,Development Director,ALS TDI,NaN
1,An Ostentatiously-Excitable Principal Research...,The Hexagon Lavish,NaN
2,Data Scientist,Xpert Staffing,NaN
3,Data Analyst,Operation HOPE,44.0
4,Assistant Professor -TT - Signal Processing & ...,Emory University,550.0
...,...,...,...
6959,Data Developer / Machine Learning Analyst,NetApp,574.0
6960,Scientist I,"Pharmacyclics, an Abbvie Company",26.0
6961,Intern Scientist,Oath Inc,5.0
6962,Senior Data & Applied Scientist,Microsoft,4618.0
6963,"Principal Data Scientist, Deep Learning",Comcast,11610.0